tests/blazedemo-journey.yml
settings:
  env:
    BLAZEDEMO_BASE_URL: http://blazedemo.com
    INPUT_CSV_FILE: ./data.csv

#included-configs:
#- http://central.host/mystorage/remote.yml

execution:
- concurrency: 5
  hold-for: 20s
  ramp-up: 10s
  write-xml-jtl: full # enable full logging of http request and response details as trace.jtl file. Useful for debugging in sanity, but not recommended for soak or load level testing
  scenario: blazedemo-journey

scenarios:
  blazedemo-journey:
    data-sources:
      - path: ${INPUT_CSV_FILE}
        delimiter: ','
        quoted: true
        loop: true
        variable-names: fromPort,toPort,flightIndex
    requests:
    - url: ${BLAZEDEMO_BASE_URL}/
      method: GET
      label: home
    - url: ${BLAZEDEMO_BASE_URL}/reserve.php
      method: POST
      label: reserve
      body: "fromPort=${fromPort}&toPort=${toPort}"
      headers:
        Content-Type: application/x-www-form-urlencoded
      extract-regexp:
        flightId:
          regexp: <input.*value="(.*)".*name="flight">
          default: NOT_FOUND
          match-no: ${flightIndex}
          template: 1  # which capture group to take
          subject: body
          scope: all
        price:
          regexp: <input.*value="(.*)".*name="price">
          default: NOT_FOUND
          match-no: ${flightIndex}
          template: 1  # which capture group to take
          subject: body
          scope: all
        flightName:
          regexp: <input.*value="(.*)".*name="airline">
          default: NOT_FOUND
          match-no: ${flightIndex}
          template: 1  # which capture group to take
          subject: body
          scope: all
    - url: ${BLAZEDEMO_BASE_URL}/purchase.php
      method: POST
      label: purchase
      body: "flight=${flightId}&price=${price}&airline=${flightName}&fromPort=${fromPort}&toPort=${toPort}"
      headers:
        Content-Type: application/x-www-form-urlencoded